I just modified examples/spot_instances_main.tf to set `asg_desired_capacity = 1` and ran a plan on an empty state:
```hcl
  # module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
```

How are you deleting the resource? You may have to remove it from the terraform state file and not just AWS for the change to be picked up: `terraform state rm module.eks.aws_autoscaling_group.workers_launch_template[0]`